DataProcessors/АвтообработкаЗаказаПокупателяПоНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>АвтообработкаЗаказаПокупателяПоНП</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СтатусыЗаказовПокупателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТТН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НП_ТТН_Доп</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийМаршрута</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоступлениеТоваровУслуг</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отгрузка</Name>
							<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплата</Name>
							<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыОперацийПартииТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Запись сформирована при списании партий</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКорСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСписанныхТоваров</Name>
					<Comment>Индекс строки списанных товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПоручениеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/БП_ВидЗаказаПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>БП_ВидЗаказаПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Менеджер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/БП_СообщениеДляАдминистратораНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>БП_СообщениеДляАдминистратораНП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтатусТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/АвтообработкаЗаказаПокупателяПоНП/Ext/ObjectModule.bsl
Процедура ОбновитьСтатусы() Экспорт
	
	СкладНП = Справочники.Склады.НайтиПоКоду("000000012");
	ГраницаОбработкиЗаказов = НачалоДня(ТекущаяДата()) - (24 * 3600 * 14);
	СтатусВыполнен = Справочники.Статусы.НайтиПоКоду("000000037",,,);
	СтатусыЗаказовПокупателя.Очистить(); 
		
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	ЗаказПокупателя.Ссылка,
	                      |	ЗаказПокупателя.НП_ТТН,
						  |	ЗаказПокупателя.НП_ТТН_Доп,
	                      |	ЗаказПокупателя.НП_APIКлюч
	                      |ИЗ
	                      |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			ПеремещениеТоваров.Ссылка КАК Ссылка,
	                      |			ПеремещениеТоваров.ВнутреннийЗаказ КАК ВнутреннийЗаказ
	                      |		ИЗ
	                      |			Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                      |		ГДЕ
	                      |			ПеремещениеТоваров.Дата >= &ГраницаОбработкиЗаказов
	                      |			И ПеремещениеТоваров.СкладПолучатель = &СкладНП
	                      //|			И ПеремещениеТоваров.Проведен
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			ПеремещениеТоваров.Ссылка,
	                      |			ПеремещениеТоваров.ВнутреннийЗаказ) КАК ПеремещенияНП
	                      |		ПО ЗаказПокупателя.Ссылка = ПеремещенияНП.ВнутреннийЗаказ
	                      |ГДЕ
	                      |	ЗаказПокупателя.Проведен
	                      |	И ЗаказПокупателя.Дата >= &ГраницаОбработкиЗаказов
	                      |	И ЗаказПокупателя.СкладГруппа = &СкладНП
	                      |	И (ЗаказПокупателя.НП_ТТН <> """" ИЛИ ЗаказПокупателя.НП_ТТН_Доп <> """")
	                      |	И ВЫБОР
	                      |			КОГДА ПеремещенияНП.Ссылка ЕСТЬ NULL
	                      |				ТОГДА ЛОЖЬ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЗаказПокупателя.Дата");
	
	Запрос.УстановитьПараметр("ГраницаОбработкиЗаказов", ГраницаОбработкиЗаказов); 
	Запрос.УстановитьПараметр("СкладНП", СкладНП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл  
		СтруктураВозврата = БП_ПолучитьСуммуОплаты(Выборка.Ссылка); 
		
		Если СтруктураВозврата.Отгрузка = СтруктураВозврата.Оплата И СтруктураВозврата.Отгрузка = Выборка.Ссылка.СуммаДокумента И Выборка.Ссылка.Статус = СтатусВыполнен тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСтатусЕН = ПолучитьСтатусПоЕН(Выборка.НП_ТТН);
		Если СтруктураСтатусЕН = Неопределено тогда
			СтруктураСтатусЕН = ПолучитьСтатусПоЕН(Выборка.НП_ТТН_Доп);				
		КонецЕсли;		
		Если СтруктураСтатусЕН = Неопределено тогда
			Продолжить;	
		КонецЕсли;

		Если СтруктураСтатусЕН.СтатусКодЕН = "1" тогда
			Продолжить;
		КонецЕсли;     
		
		НоваяСтрока = СтатусыЗаказовПокупателя.Добавить();
		НоваяСтрока.ЗаказПокупателя = Выборка.Ссылка;  
		НоваяСтрока.СтатусЗаказа = Выборка.Ссылка.Статус;
		НоваяСтрока.СуммаДокумента = Выборка.Ссылка.СуммаДокумента;
		НоваяСтрока.ТТН = Выборка.НП_ТТН;
		НоваяСтрока.НП_ТТН_Доп = Выборка.НП_ТТН_Доп;
		
		
		НоваяСтрока.СтатусКод = СтруктураСтатусЕН.СтатусКодЕН;
		НоваяСтрока.Статус = СтруктураСтатусЕН.СтатусЕН; 	
		
		НоваяСтрока.Отгрузка = СтруктураВозврата.Отгрузка;
		НоваяСтрока.Оплата = СтруктураВозврата.Оплата;
		
		Попытка
			ВыполнитьОтправкуСообщения(НоваяСтрока.СтатусКод, НоваяСтрока.Статус, Выборка.Ссылка);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры    

Функция ПолучитьСтатусПоЕН(ЕН)
	
	СтруктураВозврата = Новый Структура("СтатусКодЕН,СтатусЕН");
	
	Структура_Documents = Новый Структура();
	Структура_Documents.Вставить("DocumentNumber", ЕН);
	Структура_Documents.Вставить("Phone", "");
	
	Массив_Documents = Новый Массив;
	Массив_Documents.Добавить(Структура_Documents);
	
	Структура_methodProperties = Новый Структура;
	Структура_methodProperties.Вставить("Documents", Массив_Documents);
	
	СтруктураОтправки = Новый Структура;
	СтруктураОтправки.Вставить("apiKey", "");	  
	СтруктураОтправки.Вставить("modelName", "TrackingDocumentGeneral");
	СтруктураОтправки.Вставить("calledMethod", "getStatusDocuments");
	СтруктураОтправки.Вставить("methodProperties", Структура_methodProperties);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтправки);
	СтруктураОтправкиJSON = ЗаписьJSON.Закрыть();
		
	Заголовки = Новый Соответствие;
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение("api.novaposhta.ua/v2.0/json/",,,,,,Новый ЗащищенноеСоединениеOpenSSL(),);
	Исключение
		Сообщить("Не вдалося виконати з'єднання з сервером Нової Пошти:" 
		+ Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецПопытки;
	
	//создаем запрос данных методом POST
	ЗапросPOST = Новый HTTPЗапрос("api.novaposhta.ua/v2.0/json/", Заголовки);
	
	ЗапросPOST.Заголовки.Вставить("Content-type", "application/json"); 
	ЗапросPOST.УстановитьТелоИзСтроки(СтруктураОтправкиJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	//Отправка на сайт
	Попытка
		Результат        = HTTPСоединение.ОтправитьДляОбработки(ЗапросPOST); 
	Исключение
		Сообщить("Не вдалося виконати відправку данних на сервер Нової Пошти: "   
		+ Символы.ПС + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		Возврат Неопределено;
	КонецПопытки;
	
	
	Если Результат = Неопределено тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить("Помилка підключення! " + Результат.ПолучитьТелоКакСтроку());
	Иначе
		РезультатJSON = Новый ЧтениеJSON;
		РезультатJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
		Данные = ПрочитатьJSON(РезультатJSON);	
		
		Если Не Данные.success тогда
			//Сообщить("Була отримана негативна відповідь по результату статусу " + ЕН);
			Возврат Неопределено;
		КонецЕсли;
		
		Массив_data = Данные.data; 
		
		Для каждого СтрокаЕН из Массив_data цикл
			СтруктураВозврата.СтатусКодЕН = СтрокаЕН.StatusCode;
			СтруктураВозврата.СтатусЕН = СтрокаЕН.Status;
		КонецЦикла;                                       
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;    
	
КонецФункции

Процедура АвтообработкаЗаказов() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	СкладНП = Справочники.Склады.НайтиПоКоду("000000012");
		
	Для каждого СтрТТН из СтатусыЗаказовПокупателя цикл
		Если Не ЗначениеЗаполнено(СтрТТН.СтатусКод) ИЛИ НЕ ЗначениеЗаполнено(СтрТТН.ЗаказПокупателя) тогда
			Продолжить;
		КонецЕсли;  
		
		Если НЕ СтрТТН.Пометка тогда
			Продолжить;
		КонецЕсли;
		
		КомментарийМаршрута = "Маршрут:";
		ПоступлениеТоваровУслуг = Неопределено;
		
		
		Етап = ОпределитьЕтапСтатуса(СтрТТН.СтатусКод);   
		
		Если Етап = 1 тогда
			Етап1(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);	
		ИначеЕсли Етап = 2 тогда
			Етап1(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг); 
			СтворитиПаузу(2);
			Етап2(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);	
		ИначеЕсли Етап = 3 тогда
			Етап1(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
			СтворитиПаузу(2);
			Етап2(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
			СтворитиПаузу(2); //підозра на те що переміщення не встигає зробити рух, наслідок в тому, що реалізація не баче партії
			Етап3(СтрТТН.ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
		КонецЕсли;   
		
		СтрТТН.КомментарийМаршрута = КомментарийМаршрута;
		
		Если СтрТТН.ЗаказПокупателя.Статус <> Справочники.Статусы.НайтиПоКоду("000000018",,,) тогда
			СтруктураВозврата = БП_ПолучитьСуммуОплаты(СтрТТН.ЗаказПокупателя);
			Если СтруктураВозврата.Отгрузка = СтруктураВозврата.Оплата И СтруктураВозврата.Отгрузка = СтрТТН.СуммаДокумента тогда
				ЗаказОб = СтрТТН.ЗаказПокупателя.ПолучитьОбъект();
				ЗаказОб.Статус = Справочники.Статусы.НайтиПоКоду("000000037",,,);
				ЗаказОб.Записать();
			Иначе  
				НаложенныйПлатеж = Справочники.Статусы.НайтиПоКоду("000000041",,,);
				Если СтрТТН.ЗаказПокупателя.Статус <> НаложенныйПлатеж тогда
					ЗаказОб = СтрТТН.ЗаказПокупателя.ПолучитьОбъект();
					ЗаказОб.Статус = НаложенныйПлатеж;
					ЗаказОб.Записать();	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры 

Функция ОпределитьЕтапСтатуса(СтатусКод)

	//Маршрут
	МассивСтатусовЕтап1 = Новый Массив;
	//МассивСтатусовЕтап1.Добавить("1"); 
	МассивСтатусовЕтап1.Добавить("4");
	МассивСтатусовЕтап1.Добавить("41");
	МассивСтатусовЕтап1.Добавить("5");
	МассивСтатусовЕтап1.Добавить("6");
	//МассивСтатусовЕтап1.Добавить("12"); 
	//МассивСтатусовЕтап1.Добавить("101");
	МассивСтатусовЕтап1.Добавить("104");  
	
	МассивСтатусовЕтап2 = Новый Массив;
	МассивСтатусовЕтап2.Добавить("7"); 
	МассивСтатусовЕтап2.Добавить("8");
	
	МассивСтатусовЕтап3 = Новый Массив;
	МассивСтатусовЕтап3.Добавить("9"); 
	МассивСтатусовЕтап3.Добавить("10");
	МассивСтатусовЕтап3.Добавить("11"); 
	
	Если МассивСтатусовЕтап1.Найти(СтатусКод) <> Неопределено тогда
		Возврат 1;
	ИначеЕсли МассивСтатусовЕтап2.Найти(СтатусКод) <> Неопределено тогда 
		Возврат 2;
	ИначеЕсли МассивСтатусовЕтап3.Найти(СтатусКод) <> Неопределено тогда 
		Возврат 3;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Процедура  Етап1(ЗаказПокупателя, КомментарийМаршрута = "", ПоступлениеТоваровУслуг)
	
	ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказПоставщику.Ссылка
		                      |ИЗ
		                      |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		                      |ГДЕ
		                      |	ЗаказПоставщику.Проведен
		                      |	И ЗаказПоставщику.ДокументОснование = &ДокументОснование
		                      |	И ЗаказПоставщику.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику");
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
	Запрос.УстановитьПараметр("БП_ВидЗаказаПоставщику", Перечисления.БП_ВидЗаказаПоставщику.Менеджер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	ЗаказПоставщику = Выборка.Ссылка;	
	КонецЦикла;                          
	
	Если Не ЗначениеЗаполнено(ЗаказПоставщику) тогда 
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не знайдено замовлення постачальнику!";
		Возврат;
	Иначе
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Знайдено " + Строка(ЗаказПоставщику);	
	КонецЕсли; 
	
	//Прихід
	ПоступлениеТоваровУслуг = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПоступлениеТоваровУслуг.Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                      |ГДЕ
	                      |	ПоступлениеТоваровУслуг.Проведен
	                      |	И ПоступлениеТоваровУслуг.Сделка = &Сделка
	                      |	И ПоступлениеТоваровУслуг.ОтражатьВУправленческомУчете");
	
	Запрос.УстановитьПараметр("Сделка", ЗаказПоставщику); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	ПоступлениеТоваровУслуг = Выборка.Ссылка;	
	КонецЦикла;                          
	
	Если Не ЗначениеЗаполнено(ПоступлениеТоваровУслуг) тогда 
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не знайдено Поступление товаров и услуг!";
		
		ПоступлениеТоваровУслуг = СоздатьПоступлениеТоваровУслуг(ЗаказПоставщику);
		Если ПоступлениеТоваровУслуг.Проведен тогда
			КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Створено " + Строка(ПоступлениеТоваровУслуг);	
		Иначе	
			КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не вдалося провести створений " + Строка(ПоступлениеТоваровУслуг);		
		КонецЕсли;
	Иначе
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Знайдено " + Строка(ПоступлениеТоваровУслуг);	
	КонецЕсли;
	
КонецПроцедуры 

Функция СоздатьПоступлениеТоваровУслуг(ЗаказПоставщику)                    
	
	ПоступлениеТоваровУслуг = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	ПоступлениеТоваровУслуг.Дата = ТекущаяДата()-2;
	ПоступлениеТоваровУслуг.Заполнить(ЗаказПоставщику);
	ПоступлениеТоваровУслуг.Комментарий = "Автоматично створено " + Строка(ТекущаяДата());
	Попытка
		ПоступлениеТоваровУслуг.Записать();
		ПоступлениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ПоступлениеТоваровУслуг.Записать();	
	КонецПопытки;                          
	
	Возврат ПоступлениеТоваровУслуг;
КонецФункции

Процедура Етап2(ЗаказПокупателя, КомментарийМаршрута = "", ПоступлениеТоваровУслуг)
	
	//ПеремещениеТоваров = Документы.ПеремещениеТоваров.ПустаяСсылка();
	МассивПеремещенийТоваров = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПеремещениеТоваров.Ссылка
	                      |ИЗ
	                      |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                      |ГДЕ
	                      |	ПеремещениеТоваров.ВнутреннийЗаказ = &ЗаказПокупателя
	                      |	И НЕ ПеремещениеТоваров.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	//ПеремещениеТоваров = Выборка.Ссылка;
		МассивПеремещенийТоваров.Добавить(Выборка.Ссылка);
	КонецЦикла;                          
	
	Если Не МассивПеремещенийТоваров.Количество() тогда 
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не знайдено переміщення товарів!";
		
		ПеремещениеТоваров = СоздатьПеремещениеТоваров(ЗаказПокупателя, ПоступлениеТоваровУслуг);
		Если ПеремещениеТоваров.Проведен тогда
			КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Створено " + Строка(ПеремещениеТоваров);	
		Иначе	
			КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не вдалося провести створений " + Строка(ПеремещениеТоваров);		
		КонецЕсли;

	Иначе  
		Для каждого ПеремещениеТоваров из МассивПеремещенийТоваров цикл
			Если НЕ ПеремещениеТоваров.Проведен тогда
				ПеремещениеТоваровОб = ПеремещениеТоваров.ПолучитьОбъект();
				ПеремещениеТоваровОб.Дата = ТекущаяДата();
				ПеремещениеТоваровОб.Статус = Справочники.Статусы.НайтиПоКоду("000000016",,,); 
				Попытка
					ПеремещениеТоваровОб.Записать();
					ПеремещениеТоваровОб.Записать(РежимЗаписиДокумента.Проведение); 
				Исключение
					ПеремещениеТоваровОб.Записать();	
				КонецПопытки;  
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Знайдено та проведено " + Строка(ПеремещениеТоваров);
			Иначе
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Знайдено " + Строка(ПеремещениеТоваров);
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли; 
		
КонецПроцедуры 

Функция СоздатьПеремещениеТоваров(ЗаказПокупателя, ПоступлениеТоваровУслуг)                    
	
	ПеремещениеТоваров = Документы.ПеремещениеТоваров.СоздатьДокумент();
	ПеремещениеТоваров.Дата = ТекущаяДата()-1;
	Если ПоступлениеТоваровУслуг <> Неопределено тогда
		ПеремещениеТоваров.СкладОтправитель = ПоступлениеТоваровУслуг.СкладОрдер;	
		Если Не ЗначениеЗаполнено(ПоступлениеТоваровУслуг.СкладОрдер) И ЗначениеЗаполнено(ПоступлениеТоваровУслуг.ЗаказПоставщику) тогда
			ПеремещениеТоваров.СкладОтправитель = ПоступлениеТоваровУслуг.ЗаказПоставщику.Склад;	
		КонецЕсли;                                        
	КонецЕсли;	
	ПеремещениеТоваров.СкладПолучатель = ЗаказПокупателя.СкладГруппа;
	ПеремещениеТоваров.Заполнить(ЗаказПокупателя);                           
	ПеремещениеТоваров.СкладПолучатель = ЗаказПокупателя.СкладГруппа; 
	ПеремещениеТоваров.Статус = Справочники.Статусы.НайтиПоКоду("000000016",,,);
	ПеремещениеТоваров.Комментарий = "Автоматично створено " + Строка(ТекущаяДата());
	Попытка
		ПеремещениеТоваров.Записать();
		ПеремещениеТоваров.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ПеремещениеТоваров.Записать();	
	КонецПопытки;                          
	
	Возврат ПеремещениеТоваров;
КонецФункции 

Процедура Етап3(ЗаказПокупателя, КомментарийМаршрута = "",ПоступлениеТоваровУслуг)  
	
	РеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	РеализацияТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		                      |ГДЕ
		                      |	РеализацияТоваровУслуг.Проведен
		                      |	И РеализацияТоваровУслуг.Сделка = &ДокументОснование");
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	РеализацияТоваровУслуг = Выборка.Ссылка;	
	КонецЦикла;                          
	
	Если ЗначениеЗаполнено(РеализацияТоваровУслуг) тогда 
		КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Знайдено " + Строка(РеализацияТоваровУслуг);
		Возврат; 
	Иначе
		Если ПоступлениеТоваровУслуг = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка() тогда 
			//КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Не знайдено Поступление товаров и услуг!";
			РеализацияТоваровУслуг = СоздатьРеализацияТоваровУслуг(ЗаказПокупателя);
			Если РеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.ПустаяСсылка() тогда  
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Реалізацію не було створено, ймовірно через конфлікт блокувань. Запустіть алгоритм ще раз!";	
			Иначе
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Створено " + Строка(РеализацияТоваровУслуг);
			КонецЕсли;
		Иначе 
			РеализацияТоваровУслуг = СоздатьРеализацияТоваровУслуг(ЗаказПокупателя); 
			Если РеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.ПустаяСсылка() тогда  
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Реалізацію не було створено, ймовірно через конфлікт блокувань. Запустіть алгоритм ще раз!";	
			Иначе
				КомментарийМаршрута = КомментарийМаршрута + Символы.ПС + "Створено " + Строка(РеализацияТоваровУслуг);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
		
КонецПроцедуры 

Функция СоздатьРеализацияТоваровУслуг(ЗаказПокупателя)                    
	СкладНП = Справочники.Склады.НайтиПоКоду("000000012");
	
	РеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	РеализацияТоваровУслуг.Дата = ТекущаяДата();
	РеализацияТоваровУслуг.Заполнить(ЗаказПокупателя); 
	РеализацияТоваровУслуг.Склад = СкладНП; 
	РеализацияТоваровУслуг.Комментарий = "Автоматично створено " + Строка(ТекущаяДата());
	
	НомерСтроки = 0;
	ТоварыВрем = РеализацияТоваровУслуг.Товары.Выгрузить();
	Для Каждого СтрокаРеал Из ТоварыВрем Цикл
		
		// Отримуємо таблицю партій для цієї номенклатури (по ФІФО)
		ТзПартия = РеализацияТоваровУслугЗаполнитьПартию(
		КонецДня(РеализацияТоваровУслуг.Дата),
		СтрокаРеал.Номенклатура,
		РеализацияТоваровУслуг.Организация,
		РеализацияТоваровУслуг.Склад,
		ЗаказПокупателя
		);
		
		Остаток = СтрокаРеал.Количество;
		
		Для Каждого СтрокаПарт Из ТзПартия Цикл
			
			Если Остаток <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если СтрокаПарт.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СписатьКоличество = Мин(Остаток, СтрокаПарт.Количество);
			
			// --- Створюємо новий рядок табличної частини
			НоваяСтрока = РеализацияТоваровУслуг.Товары.Добавить();
			
			// Копіюємо реквізити з оригінального рядка
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРеал);
			
			// Проставляємо конкретну партію та кількість
			НоваяСтрока.ДокументПартии = СтрокаПарт.Партия;
			НоваяСтрока.Количество = СписатьКоличество; 
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, РеализацияТоваровУслуг);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, РеализацияТоваровУслуг);
			
			// --- Зменшуємо залишки
			Остаток = Остаток - СписатьКоличество;
			СтрокаПарт.Количество = СтрокаПарт.Количество - СписатьКоличество;
			
		КонецЦикла;
		
		// Після розподілу — видаляємо вихідний рядок (він уже розбитий)
		РеализацияТоваровУслуг.Товары.Удалить(0);
		
	КонецЦикла;	
	
	Если РеализацияТоваровУслуг.Товары.Количество() = 0 тогда
		Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		РеализацияТоваровУслуг.Записать();
		РеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		РеализацияТоваровУслуг.Записать();	
	КонецПопытки;                          
	
	Возврат РеализацияТоваровУслуг;
КонецФункции 

Функция РеализацияТоваровУслугЗаполнитьПартию(Дата, Номенклатура, Организация, Склад, ЗаказПокупателя)  
	
	//Спочатку шукаємо партію по замовленню покупця або постачальнику 
	МассивЗаказовПоставщику = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ЗаказПоставщику.Ссылка
		                      |ИЗ
		                      |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		                      |ГДЕ
		                      |	ЗаказПоставщику.Проведен
		                      |	И ЗаказПоставщику.ДокументОснование = &ДокументОснование
		                      |	И ЗаказПоставщику.БП_ВидЗаказаПоставщику = &БП_ВидЗаказаПоставщику");
	
	Запрос.УстановитьПараметр("ДокументОснование", ЗаказПокупателя); 
	Запрос.УстановитьПараметр("БП_ВидЗаказаПоставщику", Перечисления.БП_ВидЗаказаПоставщику.Менеджер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() цикл
    	МассивЗаказовПоставщику.Добавить(Выборка.Ссылка);	
	КонецЦикла;                          
	
	Если МассивЗаказовПоставщику.Количество() тогда 
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПоступлениеТоваровУслугТовары.Ссылка КАК Партия,
		                      |	ПоступлениеТоваровУслугТовары.Номенклатура,
		                      |	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
		                      |ИЗ
		                      |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		                      |ГДЕ
		                      |	ПоступлениеТоваровУслугТовары.Ссылка.Сделка В(&Сделка)
		                      |	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
		                      |	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
		                      |	И ПоступлениеТоваровУслугТовары.Ссылка.ОтражатьВУправленческомУчете
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ПоступлениеТоваровУслугТовары.Номенклатура,
		                      |	ПоступлениеТоваровУслугТовары.Ссылка");
		
		Запрос.УстановитьПараметр("Сделка", МассивЗаказовПоставщику); 
		Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		//Если ТЗ.Количество() тогда
			Возврат ТЗ;
		//КонецЕсли;
	КонецЕсли; 
		
	
	//Партія загальна 
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.ДокументОприходования Как Партия,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.КоличествоОстаток Как Количество,
	  |	ПартииТоваровНаСкладахНалоговыйУчетОстатки.СтоимостьОстаток Как Стоимость
	  |ИЗ
	  |	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	  |			&Момент,
	  |			Номенклатура = &Номенклатура
	  |				И Склад = &Склад) КАК ПартииТоваровНаСкладахНалоговыйУчетОстатки";
	  Запрос.УстановитьПараметр("Момент",КонецДня(Дата));
	  Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	  Запрос.УстановитьПараметр("Организация",Организация);
	  Запрос.УстановитьПараметр("Склад",Склад);
	  ТЗПартии = Запрос.Выполнить().Выгрузить();	
	  
	  ТЗПартииВозврат = ТЗПартии.СкопироватьКолонки();
	  
	  Для каждого СтрПартия из ТЗПартии цикл
		  Если ПроверитьЗанятаЛиПартияДругимЗаказомПокупателя(СтрПартия.Партия, ЗаказПокупателя, Номенклатура, Склад) тогда
			  Продолжить;
		  КонецЕсли;
		  
		  НовСтрока = ТЗПартииВозврат.Добавить();    
		  ЗаполнитьЗначенияСвойств(НовСтрока,СтрПартия);
	  КонецЦикла;
	  
	  Возврат ТЗПартииВозврат; 
	  
  КонецФункции 
  
Функция ПроверитьЗанятаЛиПартияДругимЗаказомПокупателя(ДокПартия, ЗаказПокупателя, Номенклатура, Склад)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВРезервеНаСкладах.ДокументРезерва
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
	                      |ГДЕ
	                      |	ТоварыВРезервеНаСкладах.Регистратор = &ДокПартия
	                      |	И ТоварыВРезервеНаСкладах.Номенклатура = &Номенклатура
	                      |	И ТоварыВРезервеНаСкладах.Склад = &Склад
	                      |	И ТоварыВРезервеНаСкладах.ДокументРезерва <> &ДокументРезерва");
	
	Запрос.УстановитьПараметр("ДокПартия", ДокПартия); 
	Запрос.УстановитьПараметр("ДокументРезерва", ЗаказПокупателя); 
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ.Количество();
КонецФункции

Функция БП_ПолучитьСуммуОплаты(Ссылка)
	//+БП: d.matyash (02.10.2025) <>  
	СтруктураВозврата = Новый Структура("Отгрузка,Оплата",0,0);
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка,
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход, 0)) КАК Отгрузка,
	|	СУММА(ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход, 0)) КАК Оплата
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(, , , , Сделка в (&Док)) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Сделка";
	
	Запрос.УстановитьПараметр("Док", Ссылка);
	тзОстатки = Запрос.Выполнить().Выбрать();
	Если тзОстатки.НайтиСледующий(Ссылка ,"Сделка" ) Тогда
		Если тзОстатки.Оплата <> 0 ИЛИ тзОстатки.Отгрузка <> 0 Тогда   
			ЗаполнитьЗначенияСвойств(СтруктураВозврата,тзОстатки);
			Возврат	СтруктураВозврата;
		КонецЕсли;		
	КонецЕсли;  
	
	Возврат СтруктураВозврата;    
	//-БП: d.matyash (02.10.2025) <>
КонецФункции

Процедура ВыполнитьОтправкуСообщения(КодСтатуса, Статус, Ссылка)
	ЭлектронныеПисьма = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	БП_СообщениеДляАдминистратораНП.Ссылка,
	                      |	БП_СообщениеДляАдминистратораНП.ПочтаПолучателя,
	                      |	БП_СообщениеДляАдминистратораНП.Сообщение
	                      |ИЗ
	                      |	Справочник.БП_СообщениеДляАдминистратораНП КАК БП_СообщениеДляАдминистратораНП
	                      |ГДЕ
	                      |	НЕ БП_СообщениеДляАдминистратораНП.ПометкаУдаления
	                      |	И БП_СообщениеДляАдминистратораНП.Отправлять
	                      |	И БП_СообщениеДляАдминистратораНП.КодСтатусТТН = &КодСтатуса");
	
	Запрос.УстановитьПараметр("КодСтатуса",КодСтатуса);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() цикл
		СтруктураВложений  = Новый СписокЗначений; 
		ТекстПисьмаСсылки = Выборка.Сообщение;
		
		Адрес = Выборка.ПочтаПолучателя;
		
		СписокАдресов = Новый СписокЗначений;
		Если НЕ Адрес = Неопределено Тогда
			СписокАдресов.Добавить(Адрес, Адрес);
		КонецЕсли;
		
		ТекстПисьма = ТекстПисьмаСсылки;
		ТекстПисьмаHTML = "<HTML><HEAD><META http-equiv=Content-Type content=""text/html; charset=utf-8""><META content=""MSHTML 6.00.2800.1476"" name=GENERATOR></HEAD><BODY><P>";
		ТекстПисьмаHTML = ТекстПисьмаHTML + СтрЗаменить(ТекстПисьма, Символы.ПС, "</P><P>");
		ТекстПисьмаHTML = ТекстПисьмаHTML + "</P></BODY></HTML>"; 
		
		СтруктураНовогоПисьма                      = Новый Структура("Тело, Тема, СписокФайловВложений, Кому");
		СтруктураНовогоПисьма.СписокФайловВложений = СтруктураВложений;
		СтруктураНовогоПисьма.Тело                 = ТекстПисьмаHTML;
		СтруктураНовогоПисьма.Тема                 = Строка(Ссылка) + " набуло статусу: " + Статус;
		СтруктураНовогоПисьма.Кому                 = СписокАдресов;
		
		СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(глЗначениеПеременной("глТекущийПользователь"), СтруктураНовогоПисьма, , , , , ,Истина , ЛОЖЬ);
		
		Если ТипЗнч(СтруктураПисьма) = Тип("Структура") Тогда
			ЭлектронныеПисьма.Вставить(СтруктураПисьма.ПисьмоСсылка);
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЭлектронныеПисьма.Количество() тогда
		УправлениеЭлектроннойПочтой.ОтправитьПисьма(ЭлектронныеПисьма, глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
	
КонецПроцедуры

Процедура СтворитиПаузу(Секунд);
	КонДата = ТекущаяДата() + Секунд;
	Пока ТекущаяДата() < КонДата Цикл
		// ОЖИДАЕМ!!!
	КонецЦикла;
КонецПроцедуры

Процедура АвтообработкаЗаказовПоТТН(ЗаказПокупателя, ТТН) Экспорт
	    УстановитьПривилегированныйРежим(Истина);
		
		СкладНП = Справочники.Склады.НайтиПоКоду("000000012");

		СтруктураСтатусЕН = ПолучитьСтатусПоЕН(ТТН);		
		Если СтруктураСтатусЕН = Неопределено тогда
			Возврат;
		КонецЕсли;
		
		СтатусКод = СтруктураСтатусЕН.СтатусКодЕН; 
		Сообщить("Статус ТТН: " + Строка(СтруктураСтатусЕН.СтатусЕН));
		
		КомментарийМаршрута = "Маршрут:";
		ПоступлениеТоваровУслуг = Неопределено;
		
		
		Етап = ОпределитьЕтапСтатуса(СтатусКод);   
		
		Если Етап = 1 тогда
			Етап1(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);	
		ИначеЕсли Етап = 2 тогда
			Етап1(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг); 
			СтворитиПаузу(2);
			Етап2(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);	
		ИначеЕсли Етап = 3 тогда
			Етап1(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
			СтворитиПаузу(2);
			Етап2(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
			СтворитиПаузу(2);
			Етап3(ЗаказПокупателя, КомментарийМаршрута, ПоступлениеТоваровУслуг);
		КонецЕсли;   
		
		Сообщить(КомментарийМаршрута);
		
КонецПроцедуры
